---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Size
source: html/fc97d569-248e-ffc8-67b3-08dd1498756d.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Size Property

Returns the number of conduit types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```